# DimLabel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLabel Property
ParameterTypeId Class See Also
---
"Label"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLabel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLabel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLabel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace